code/Transbank/Webpay/logs/webpay-2017-08-19.txt

19:17:05 - datos request initTransaction 
Array
(
    [wSTransactionType] => TR_NORMAL_WS
    [commerceId] => 
    [buyOrder] => 000000693
    [sessionId] => 
    [returnURL] => http://kivulqa.xpectrumtech.com/webpay/payment/response
    [finalURL] => http://kivulqa.xpectrumtech.com/webpay/payment/success
    [transactionDetails] => Array
        (
            [commerceCode] => 597020000541
            [buyOrder] => 000000693
            [amount] => 61900
        )

)

19:17:07 - initTransaction request  - <?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1"><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-389567"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-389566"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>JDpxFEbcPmnoytUSndZ/cm88Mk4=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>idraqmvZ3WIMQ0WFc5noSA4tIkH2ZZplKQd5rjzwWCcwKPD5VyYuKStmOarq4NcNyVCy5S/tHKAx
l2UQME9FQ1P/UuMprfbpUkJmp7qNY/vt9WkkShSWcqDsPronMHdCkcCLn/Ho4DSYkxcdVEtdGDu2
szbP16LRIXu0PHIZA97MlcX9Ua7iW9wXOOqUAAqlFuLvzi6gdi4NFfPkSHAsF+J5+4ATFocDB6GZ
lt6FYIuHHXBgCvCyVMIbtTo0W+WTTGmCDMu/tqQZl67PeES8HchUX4uXUoleSpLCWVYWHKkd0ju3
RUMqcZLUyOeK7B6EZPCuWS6Mwlc/KgLcAwNBRg==</ds:SignatureValue><ds:KeyInfo Id="KI-7DF136BBB9F24278A11503170225041584393"><wsse:SecurityTokenReference wsu:Id="STR-7DF136BBB9F24278A11503170225041584394"><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=10,OU=kdu,O=kdu,L=Santiago,ST=Chile,C=CL</ds:X509IssuerName><ds:X509SerialNumber>1449520866</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soap:Header><soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-389566"><ns2:initTransactionResponse xmlns:ns2="http://service.wswebpay.webpay.transbank.com/"><return><token>e5f941c30c8916041171b2995c09e6f6938c462ed1172ca792e2e0933976d5a9</token><url>https://webpay3gint.transbank.cl/filtroUnificado/initTransaction</url></return></ns2:initTransactionResponse></soap:Body></soap:Envelope>

19:17:07 - initTransaction response - <?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1"><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-389567"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-389566"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>JDpxFEbcPmnoytUSndZ/cm88Mk4=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>idraqmvZ3WIMQ0WFc5noSA4tIkH2ZZplKQd5rjzwWCcwKPD5VyYuKStmOarq4NcNyVCy5S/tHKAx
l2UQME9FQ1P/UuMprfbpUkJmp7qNY/vt9WkkShSWcqDsPronMHdCkcCLn/Ho4DSYkxcdVEtdGDu2
szbP16LRIXu0PHIZA97MlcX9Ua7iW9wXOOqUAAqlFuLvzi6gdi4NFfPkSHAsF+J5+4ATFocDB6GZ
lt6FYIuHHXBgCvCyVMIbtTo0W+WTTGmCDMu/tqQZl67PeES8HchUX4uXUoleSpLCWVYWHKkd0ju3
RUMqcZLUyOeK7B6EZPCuWS6Mwlc/KgLcAwNBRg==</ds:SignatureValue><ds:KeyInfo Id="KI-7DF136BBB9F24278A11503170225041584393"><wsse:SecurityTokenReference wsu:Id="STR-7DF136BBB9F24278A11503170225041584394"><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=10,OU=kdu,O=kdu,L=Santiago,ST=Chile,C=CL</ds:X509IssuerName><ds:X509SerialNumber>1449520866</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soap:Header><soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-389566"><ns2:initTransactionResponse xmlns:ns2="http://service.wswebpay.webpay.transbank.com/"><return><token>e5f941c30c8916041171b2995c09e6f6938c462ed1172ca792e2e0933976d5a9</token><url>https://webpay3gint.transbank.cl/filtroUnificado/initTransaction</url></return></ns2:initTransactionResponse></soap:Body></soap:Envelope>

19:17:55 - transactionResult request  - <?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://service.wswebpay.webpay.transbank.com/"><SOAP-ENV:Body><ns1:getTransactionResult><tokenInput>e5f941c30c8916041171b2995c09e6f6938c462ed1172ca792e2e0933976d5a9</tokenInput></ns1:getTransactionResult></SOAP-ENV:Body></SOAP-ENV:Envelope>

19:17:55 - transactionResult response - <?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1"><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-331848"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-331847"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>gT+rSrndD5F3d7QmXdz80KfLArs=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>IWruAp/eAP75HSJoU68zZ88WjSJBc+mBqCsJVy7cL7iXsT2Xv+F3UiJKu08r8/zyNchzC9vCqlqY
ZeLTL4BHjMMDYaPQRxo7P+BCNUPCrIr8ziXh2yvX5I3zAyM/iSZKk7Lc3IIfa4oYPB15XwjNluot
RQvIg2ktuHVprY9jCr1lV+MKd5YZmzk6LyWNrHszWnmJHmhH9j+s5+/y7r2LaxNefnp/o+4ZoBR0
CVBVTYQE31Td2JVL5iDPuNM9eNHiKlRi3y0JBk1yWURIVz6ZlWVgC8GIripXOglazWtosiM3ZqN2
Sgy+7SE0gfFs3Oc4qsqTpF/WxCqGdJ5vG4ol0Q==</ds:SignatureValue><ds:KeyInfo Id="KI-BA1EF8A8C5ED5D4E6C1503170273635497786"><wsse:SecurityTokenReference wsu:Id="STR-BA1EF8A8C5ED5D4E6C1503170273635497787"><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=10,OU=kdu,O=kdu,L=Santiago,ST=Chile,C=CL</ds:X509IssuerName><ds:X509SerialNumber>1449520866</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soap:Header><soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-331847"><ns2:getTransactionResultResponse xmlns:ns2="http://service.wswebpay.webpay.transbank.com/"><return><accountingDate>0819</accountingDate><buyOrder>000000693</buyOrder><cardDetail><cardNumber>6623</cardNumber></cardDetail><detailOutput><sharesNumber>0</sharesNumber><amount>61900</amount><commerceCode>597020000541</commerceCode><buyOrder>000000693</buyOrder><authorizationCode>1213</authorizationCode><paymentTypeCode>VN</paymentTypeCode><responseCode>0</responseCode></detailOutput><transactionDate>2017-08-19T15:17:04.788-04:00</transactionDate><urlRedirection>https://webpay3gint.transbank.cl/filtroUnificado/voucher.cgi</urlRedirection><VCI>TSY</VCI></return></ns2:getTransactionResultResponse></soap:Body></soap:Envelope>

19:17:56 - acknowledgeTransaction request  - <?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://service.wswebpay.webpay.transbank.com/"><SOAP-ENV:Body><ns1:acknowledgeTransaction><tokenInput>e5f941c30c8916041171b2995c09e6f6938c462ed1172ca792e2e0933976d5a9</tokenInput></ns1:acknowledgeTransaction></SOAP-ENV:Body></SOAP-ENV:Envelope>

19:17:56 - acknowledgeTransaction response - <?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1"><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-331850"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-331849"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>6AWR+6FHmrEtVB1auDentjzUl58=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>RBc4M4/X0n/E2K/sRFWno/Z/AAH9bU0vnIlsHbhJh3lpzJRUNh+wECmfPepmQrJXRd4PCPKtyrYN
zomDuJHlmAGzEOws14xNhpXmlnkv9ti2PXeKSm+QOD2CMIo7nYtbjSzR/kD2DeTKPpD81whogO5O
yxB2yPhPoekIqLilTendIJHXw+a6apaqibQ04/LQ3jqk4mubuqGMnT2NzBHSveaw0achxpQvHCP+
9xYavNL/cKBhPcGMNvNys8dcXDXAHv+jPae2aKrwfzvvPuka34Z5cEXScdSWrJF8GUhGCMBC+9b3
oRqZ7KwyjXnh4omD0eLroYuTp91VnyWEOYKXrA==</ds:SignatureValue><ds:KeyInfo Id="KI-BA1EF8A8C5ED5D4E6C1503170275144497789"><wsse:SecurityTokenReference wsu:Id="STR-BA1EF8A8C5ED5D4E6C1503170275144497790"><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=10,OU=kdu,O=kdu,L=Santiago,ST=Chile,C=CL</ds:X509IssuerName><ds:X509SerialNumber>1449520866</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soap:Header><soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-331849"><ns2:acknowledgeTransactionResponse xmlns:ns2="http://service.wswebpay.webpay.transbank.com/"/></soap:Body></soap:Envelope>

